; domain
(define (domain miconic)
  (:requirements :typing :conditional-effects :negative-preconditions)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop

(:action stop
  :parameters (?f - floor)
  :precondition (lift-at ?f)
  :effect (and 
               (forall (?p - passenger) 
                  (when (and (boarded ?p) 
                             (destin ?p ?f))
                        (and (not (boarded ?p)) 
                             (served  ?p))))
               (forall (?p - passenger)                
                   (when (and (origin ?p ?f) (not (served ?p)))
                              (boarded ?p)))))


;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f10-p5-u0-v0-g0-a0-n0-A0-B0-N0-F0-r0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)

(above f6 f7)
(above f6 f8)
(above f6 f9)

(above f7 f8)
(above f7 f9)

(above f8 f9)



(origin p0 f3)
(destin p0 f6)

(origin p1 f7)
(destin p1 f5)

(origin p2 f3)
(destin p2 f5)

(origin p3 f6)
(destin p3 f2)

(origin p4 f9)
(destin p4 f1)






(lift-at f0)
)


(:goal (and 
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
))
)

; plan
1. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 0 of 5
2. (up f1 f3)
   deleted: (lift-at f1)
   added: (lift-at f3)
   goals met: 0 of 5
3. (stop f3)
   added: (boarded p0) (boarded p2)
   goals met: 0 of 5
4. (down f3 f1)
   deleted: (lift-at f3)
   added: (lift-at f1)
   goals met: 0 of 5
5. (up f1 f6)
   deleted: (lift-at f1)
   added: (lift-at f6)
   goals met: 0 of 5
6. (stop f6)
   deleted: (boarded p0)
   added: (served p0) (boarded p3)
   goals met: 1 of 5
7. (down f6 f1)
   deleted: (lift-at f6)
   added: (lift-at f1)
   goals met: 1 of 5
8. (up f1 f2)
   deleted: (lift-at f1)
   added: (lift-at f2)
   goals met: 1 of 5
9. (stop f2)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 2 of 5
10. (down f2 f1)
   deleted: (lift-at f2)
   added: (lift-at f1)
   goals met: 2 of 5
11. (up f1 f7)
   deleted: (lift-at f1)
   added: (lift-at f7)
   goals met: 2 of 5
12. (stop f7)
   added: (boarded p1)
   goals met: 2 of 5
13. (down f7 f1)
   deleted: (lift-at f7)
   added: (lift-at f1)
   goals met: 2 of 5
14. (up f1 f5)
   deleted: (lift-at f1)
   added: (lift-at f5)
   goals met: 2 of 5
15. (stop f5)
   deleted: (boarded p1) (boarded p2)
   added: (served p1) (served p2)
   goals met: 4 of 5
16. (down f5 f1)
   deleted: (lift-at f5)
   added: (lift-at f1)
   goals met: 4 of 5
17. (up f1 f9)
   deleted: (lift-at f1)
   added: (lift-at f9)
   goals met: 4 of 5
18. (stop f9)
   added: (boarded p4)
   goals met: 4 of 5
19. (down f9 f1)
   deleted: (lift-at f9)
   added: (lift-at f1)
   goals met: 4 of 5
20. (stop f1)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 5 of 5
